{"start":{"words":[],"letter":"\u0000","links":[null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,{"words":[],"letter":"a","links":[null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,{"words":[],"letter":"i","links":[null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,{"words":[{"word":"air","pronounciation":"[air]","keywords":["gases forming the atmosphere","distinctive quality or character","style","musical tune","put into the atmosphere","freshen","express opinion publicly"],"definitions":["a mixture of nitrogen, oxygen, and minute amounts of other gases that surrounds the earth and forms its atmosphere.","a stir in the atmosphere; a light breeze.","overhead space; sky","circulation; publication; publicity","the general character or complexion of anything; appearance","the peculiar look, appearance, and bearing of a person","airs, affected or unnatural manner; manifestation of pride or vanity; assumed haughtiness","Music. a tune; melody. the soprano or treble part. an aria. Also ayre.an Elizabethan art song.","aircraft as a means of transportation","Informal. air conditioning or an air-conditioning system","Sports. (during an airborne stunt) the height between the ground and an athlete or an athlete with his or her equipment","Radio. the medium through which radio waves are transmitted.","Archaic. breath.","to expose to the air; give access to the open air; ventilate (often followed by out)","to expose ostentatiously; bring to public notice; display","to broadcast or televise.","to be exposed to the open air (often followed by out)","to be broadcast or televised.","operating by means of air pressure or by acting upon air","of or relating to aircraft or to aviation","taking place in the air; aerial","clear the air, to eliminate dissension, ambiguity, or tension from a discussion, situation, etc.","get some air, to take a break from an unpleasant encounter or stifling environment","get the air, Informal. to be rejected, as by a lover. to be dismissed, as by an employer","give (someone) the air, Informal. to reject, as a lover","in the air, in circulation; current","into thin air, completely out of sight or reach","off the air, not broadcasting","on the air, in the act of broadcasting; being broadcast","put on airs, to assume an affected or haughty manner","take the air, to go out-of-doors; take a short walk or ride. Slang.to leave, especially hurriedly. to begin broadcasting.","up in the air, Also in the air.undecided or unsettled","walk/tread on air, to feel very happy; be elated.","early.","Obsolete. before; previously.","a region in N Niger, in the Sahara"],"exampleSentences":[null,null," The planes filled the air."," to give air to one\u0027s theories."," His early work had an air of freshness and originality."," There is an air of mystery about him."," He acquired airs that were insufferable to his friends.",null," to arrive by air; to ship goods by air."," The price includes tires, radio, and air."," The BMX course was designed for riders to get good air. such a jump or other airborne stunt: The snowboarder took first place with four clean airs.",null,null," We air the bedrooms every day."," to air one\u0027s opinions; to air one\u0027s theories.",null," Open the window and let the room air out.",null," an air drill; an air pump."," air industry."," air war."," The staff meeting was intended to help clear the air."," She walked away from the argument to get some air. to take a short rest."," He had worked only a few days when he got the air."," He was bitter because she gave him the air. to dismiss, as an employee."," There\u0027s a rumor in the air that we\u0027re moving to a new location."," He vanished into thin air."," The station goes off the air at midnight. not broadcast; out of operation as a broadcast: The program went off the air years ago."," The program will be going on the air in a few seconds."," As their fortune increased, they began to put on airs.",null," The contract is still up in the air. Informal.angry; perturbed: There is no need to get up in the air over a simple mistake.",null,null,null," low massif and oases. About 30,000 sq. mi. (77,700 sq. km)."],"etymology":"c. 1300, \"invisible gases that surround the earth,\" from Old French air \"atmosphere, breeze, weather\" (12c.), from Latin aer \"air, lower atmosphere, sky,\" from Greek aer (genitive aeros) \"mist, haze, clouds,\" later \"atmosphere\" (related to aenai \"to blow, breathe\"), which is of unknown origin. It is possibly from a PIE *awer- and thus related to aeirein \"to raise\" and arteria \"windpipe, artery\" (see aorta) on notion of \"lifting, suspended, that which rises,\" but this has phonetic difficulties. In Homer mostly \"thick air, mist;\" later \"air\" as one of the four elements. Words for \"air\" in Indo-European languages tend to be associated with wind, brightness, sky. In English, air replaced native lyft, luft (see loft (n.)). In old chemistry, air (with a qualifying adjective) was used of any gas. To be in the air \"in general awareness\" is from 1875; up in the air \"uncertain, doubtful\" is from 1752. To build castles in the air \"entertain visionary schemes that have no practical foundation\" is from 1590s (in 17c. English had airmonger \"one preoccupied with visionary projects\"). Broadcasting sense (as in on the air, airplay) first recorded 1927. To give (someone) the air \"dismiss\" is from 1900. Air pollution is attested by 1870. Air guitar by 1983. Air traffic controller is from 1956. 1590s, \"manner, appearance\" (as in an air of mystery); 1650s, \"assumed manner, affected appearance\" (especially in phrase put on airs, 1781), from French air \"look, appearance, mien, bearing, tone\" (Old French aire \"reality, essence, nature, descent, extraction\" (12c.); compare debonair), which is perhaps from Latin ager \"place, field, productive land\" (from PIE root *agro- \"field\") on notion of \"place of origin.\" But some French sources connect this Old French word with the source of air (n.1), and it also is possible these senses in English developed from or were influenced by air (n.1); compare sense development of atmosphere and Latin spiritus \"breath, breeze,\" also \"high spirit, pride,\" and the extended senses of anima. \"melody, tune, connected rhythmic succession of distinct musical sounds,\" 1580s, nativized from Italian aria (see aria), perhaps via French. 1520s, \"expose to open air,\" 1520s, from air (n.1). Figurative sense of \"expose ostentatiously, make public\" is from 1610s of objects, 1862 of opinions, grievances, etc. Meaning \"to broadcast\" (originally on radio) is from 1933. Related: Aired; airing.","totRight":0,"totWrong":0,"consecRight":0,"consecWrong":0,"totConsecRight":0,"dataPoints":0,"avgConsecRight":0.0,"turnsLeft":0}],"letter":"r","links":[null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null]},null,null,null,null,null,null,null,null]},null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null]},null,null,{"words":[],"letter":"d","links":[null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,{"words":[],"letter":"o","links":[null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,{"words":[],"letter":"w","links":[null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,{"words":[{"word":"down","pronounciation":"[doun]","keywords":["below","physically lower","unhappy"],"definitions":["from higher to lower; in descending direction or order; toward, into, or in a lower position","on or to the ground, floor, or bottom","to or in a sitting or lying position.","to or in a position, area, or district considered lower, especially from a geographical or cartographic standpoint, as to the south, a business district, etc.","to or at a lower value or rate.","to a lesser pitch or volume","in or to a calmer, less active, or less prominent state","from an earlier to a later time","from a greater to a lesser strength, amount, etc.","in an attitude of earnest application","on paper or in a book","in cash at the time of purchase; at once","to the point of defeat, submission, inactivity, etc.","in or into a fixed or supine position","to the source or actual position","into a condition of ill health","in or into a lower status or condition","Nautical. toward the lee side, so as to turn a vessel to windward","Slang. on toast (as used in ordering a sandwich at a lunch counter or restaurant)","in a descending or more remote direction or place on, over, or along","downward; going or directed downward","being at a low position or on the ground, floor, or bottom.","toward the south, a business district, etc.","associated with or serving traffic, transportation, or the like, directed toward the south, a business district, etc.","downcast; depressed; dejected","ailing, especially, sick and bedridden","being the portion of the full price, as of an article bought on the installment plan, that is paid at the time of purchase or delivery","Football. (of the ball) not in play.","Slang. agreeing, supporting, or understanding","behind an opponent or opponents in points, games, etc.","Baseball. out.","losing or having lost the amount indicated, especially at gambling","having placed one\u0027s bet","finished, done, considered, or taken care of","out of order","a downward movement; descent.","a turn for the worse; reverse","Football. one of a series of four plays during which a team must advance the ball at least 10 yards (9 meters) to keep possession of it. the declaring of the ball as down or out of play, or the play immediately preceding this.","Slang. an order of toast at a lunch counter or restaurant.","Slang. downer(defs 1a, b).","to put, knock, or throw down; subdue","to drink down, especially quickly or in one gulp","Informal. to defeat in a game or contest","to cause to fall from a height, especially by shooting","to go down; fall.","(used as a command to a dog to stop attacking, to stop jumping on someone, to get off a couch or chair, etc.)","(used as a command or warning to duck, take cover, or the like)","down and out, down-and-out.","down cold/pat, mastered or learned perfectly","down in the mouth, discouraged; depressed; sad.","down on, Informal. hostile or averse to","down with! away with! cease!","the soft, first plumage of many young birds.","the soft under plumage of birds as distinct from the contour feathers.","the under plumage of some birds, as geese and ducks, used for filling in quilts, clothing, etc., chiefly for warmth.","a growth of soft, fine hair or the like.","Botany. a fine, soft pubescence on plants and some fruits. the light, feathery pappus or coma on seeds by which they are borne on the wind, as on the dandelion and thistle.","filled with down","Often downs. (used especially in southern England) open, rolling, upland country with fairly smooth slopes usually covered with grass.","(initial capital letter) any sheep of several breeds, raised originally in the downs of southern England, as the Southdown, Suffolk, etc.","Archaic. a hill, especially a sand hill or dune.","a county in SW Northern Ireland. 952 sq. mi. (2466 sq. km). County seat","an administrative district in this county. 253 sq. mi. (654 sq. km)."],"exampleSentences":[" to come down the ladder."," He fell down.",null," We drove from San Francisco down to Los Angeles.",null," Turn down the radio."," The wind died down."," from the 17th century down to the present."," to water down liquor."," to get down to work."," Write down the address."," We paid $50 down and $20 a month."," They shouted down the opposition."," They tied down the struggling animal."," The dogs tracked down the bear."," He\u0027s come down with a cold."," kept down by lack of education."," Put the helm down!"," Give me a tuna down."," They ran off down the street."," the down escalator.",null,null," the down platform."," You seem very down today."," He\u0027s been down with a bad cold."," a payment of $200 down.",null," I\u0027m totally down with that. He\u0027s down with those kids. sophisticated or hip; cool: That music is down."," The team won the pennant despite having been down three games in the final week of play.",null," After an hour at poker, he was down $10."," Are you down for the fourth race?"," five down and one to go."," The computer has been down all day.",null," The business cycle experienced a sudden down.",null,null,null," He downed his opponent in the third round."," to down a tankard of ale."," The Mets downed the Dodgers in today\u0027s game."," Antiaircraft guns downed ten bombers.",null," Down, Rover!"," Down! They\u0027re starting to shoot!",null," Another hour of studying and I\u0027ll have the math lesson down cold.",null," Why are you so down on sports?"," Down with tyranny! on or toward the ground or into a lower position: Down with your rifles!",null,null,null,null,null," a down jacket.",null,null,null," Downpatrick.",null],"etymology":"late Old English shortened form of Old English ofdune \"downwards,\" from dune \"from the hill,\" dative of dun \"hill\" (see down (n.2)). A sense development peculiar to English. Used as a preposition since c. 1500. Sense of \"depressed mentally\" is attested from c. 1600. Slang sense of \"aware, wide awake\" is attested from 1812. Computer crash sense is from 1965. As a preposition from late 14c.; as an adjective from 1560s. Down-and-out is from 1889, American English, from situation of a beaten prizefighter. Down home (adj.) is 1931, American English; down the hatch as a toast is from 1931; down to the wire is 1901, from horse-racing. Down time is from 1952. Down under \"Australia and New Zealand\" attested from 1886; Down East \"Maine\" is from 1825; Down South \"in the Southern states of the U.S.\" is attested by 1834. \"soft feathers,\" late 14c., from Old Norse dunn, of uncertain origin. Old English dun \"down, moor; height, hill, mountain,\" from Proto-Germanic *dunaz- (source also of Middle Dutch dunen \"sandy hill,\" Dutch duin), \"probably a pre-insular loan-word from Celtic\" [Cambridge Dictionary of English Place-Names], in other words, borrowed at a very early period, before the Anglo-Saxon migration, from PIE root *dheue- \"to close, finish, come full circle.\" Meaning \"elevated rolling grassland\" is from c. 1300. The non-English Germanic words tend to mean \"dune, sand bank\" (see dune), while the Celtic cognates tend to mean \"hill, citadel\" (compare Old Irish dun \"hill, hill fort;\" Welsh din \"fortress, hill fort;\" and second element in place names London, Verdun, etc.). German Düne, French dune, Italian, Spanish duna are said to be loan-words from Dutch. 1560s, from down (adv.). Meaning \"swallow hastily\" is by 1860; football sense of \"bring down (an opposing player) by tackling\" is attested by 1887. Related: Downed; downing.","totRight":0,"totWrong":0,"consecRight":0,"consecWrong":0,"totConsecRight":0,"dataPoints":0,"avgConsecRight":0.0,"turnsLeft":0}],"letter":"n","links":[null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null]},null,null,null,null,null,null,null,null,null,null,null,null]},null,null,null]},null,null,null,null,null,null,null,null,null,null,null]},null,null,null,null,null,null,null,null,null,null,{"words":[],"letter":"o","links":[null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,{"words":[],"letter":"w","links":[null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,{"words":[{"word":"down","pronounciation":"[doun]","keywords":["below","physically lower","unhappy"],"definitions":["from higher to lower; in descending direction or order; toward, into, or in a lower position","on or to the ground, floor, or bottom","to or in a sitting or lying position.","to or in a position, area, or district considered lower, especially from a geographical or cartographic standpoint, as to the south, a business district, etc.","to or at a lower value or rate.","to a lesser pitch or volume","in or to a calmer, less active, or less prominent state","from an earlier to a later time","from a greater to a lesser strength, amount, etc.","in an attitude of earnest application","on paper or in a book","in cash at the time of purchase; at once","to the point of defeat, submission, inactivity, etc.","in or into a fixed or supine position","to the source or actual position","into a condition of ill health","in or into a lower status or condition","Nautical. toward the lee side, so as to turn a vessel to windward","Slang. on toast (as used in ordering a sandwich at a lunch counter or restaurant)","in a descending or more remote direction or place on, over, or along","downward; going or directed downward","being at a low position or on the ground, floor, or bottom.","toward the south, a business district, etc.","associated with or serving traffic, transportation, or the like, directed toward the south, a business district, etc.","downcast; depressed; dejected","ailing, especially, sick and bedridden","being the portion of the full price, as of an article bought on the installment plan, that is paid at the time of purchase or delivery","Football. (of the ball) not in play.","Slang. agreeing, supporting, or understanding","behind an opponent or opponents in points, games, etc.","Baseball. out.","losing or having lost the amount indicated, especially at gambling","having placed one\u0027s bet","finished, done, considered, or taken care of","out of order","a downward movement; descent.","a turn for the worse; reverse","Football. one of a series of four plays during which a team must advance the ball at least 10 yards (9 meters) to keep possession of it. the declaring of the ball as down or out of play, or the play immediately preceding this.","Slang. an order of toast at a lunch counter or restaurant.","Slang. downer(defs 1a, b).","to put, knock, or throw down; subdue","to drink down, especially quickly or in one gulp","Informal. to defeat in a game or contest","to cause to fall from a height, especially by shooting","to go down; fall.","(used as a command to a dog to stop attacking, to stop jumping on someone, to get off a couch or chair, etc.)","(used as a command or warning to duck, take cover, or the like)","down and out, down-and-out.","down cold/pat, mastered or learned perfectly","down in the mouth, discouraged; depressed; sad.","down on, Informal. hostile or averse to","down with! away with! cease!","the soft, first plumage of many young birds.","the soft under plumage of birds as distinct from the contour feathers.","the under plumage of some birds, as geese and ducks, used for filling in quilts, clothing, etc., chiefly for warmth.","a growth of soft, fine hair or the like.","Botany. a fine, soft pubescence on plants and some fruits. the light, feathery pappus or coma on seeds by which they are borne on the wind, as on the dandelion and thistle.","filled with down","Often downs. (used especially in southern England) open, rolling, upland country with fairly smooth slopes usually covered with grass.","(initial capital letter) any sheep of several breeds, raised originally in the downs of southern England, as the Southdown, Suffolk, etc.","Archaic. a hill, especially a sand hill or dune.","a county in SW Northern Ireland. 952 sq. mi. (2466 sq. km). County seat","an administrative district in this county. 253 sq. mi. (654 sq. km)."],"exampleSentences":[" to come down the ladder."," He fell down.",null," We drove from San Francisco down to Los Angeles.",null," Turn down the radio."," The wind died down."," from the 17th century down to the present."," to water down liquor."," to get down to work."," Write down the address."," We paid $50 down and $20 a month."," They shouted down the opposition."," They tied down the struggling animal."," The dogs tracked down the bear."," He\u0027s come down with a cold."," kept down by lack of education."," Put the helm down!"," Give me a tuna down."," They ran off down the street."," the down escalator.",null,null," the down platform."," You seem very down today."," He\u0027s been down with a bad cold."," a payment of $200 down.",null," I\u0027m totally down with that. He\u0027s down with those kids. sophisticated or hip; cool: That music is down."," The team won the pennant despite having been down three games in the final week of play.",null," After an hour at poker, he was down $10."," Are you down for the fourth race?"," five down and one to go."," The computer has been down all day.",null," The business cycle experienced a sudden down.",null,null,null," He downed his opponent in the third round."," to down a tankard of ale."," The Mets downed the Dodgers in today\u0027s game."," Antiaircraft guns downed ten bombers.",null," Down, Rover!"," Down! They\u0027re starting to shoot!",null," Another hour of studying and I\u0027ll have the math lesson down cold.",null," Why are you so down on sports?"," Down with tyranny! on or toward the ground or into a lower position: Down with your rifles!",null,null,null,null,null," a down jacket.",null,null,null," Downpatrick.",null],"etymology":"late Old English shortened form of Old English ofdune \"downwards,\" from dune \"from the hill,\" dative of dun \"hill\" (see down (n.2)). A sense development peculiar to English. Used as a preposition since c. 1500. Sense of \"depressed mentally\" is attested from c. 1600. Slang sense of \"aware, wide awake\" is attested from 1812. Computer crash sense is from 1965. As a preposition from late 14c.; as an adjective from 1560s. Down-and-out is from 1889, American English, from situation of a beaten prizefighter. Down home (adj.) is 1931, American English; down the hatch as a toast is from 1931; down to the wire is 1901, from horse-racing. Down time is from 1952. Down under \"Australia and New Zealand\" attested from 1886; Down East \"Maine\" is from 1825; Down South \"in the Southern states of the U.S.\" is attested by 1834. \"soft feathers,\" late 14c., from Old Norse dunn, of uncertain origin. Old English dun \"down, moor; height, hill, mountain,\" from Proto-Germanic *dunaz- (source also of Middle Dutch dunen \"sandy hill,\" Dutch duin), \"probably a pre-insular loan-word from Celtic\" [Cambridge Dictionary of English Place-Names], in other words, borrowed at a very early period, before the Anglo-Saxon migration, from PIE root *dheue- \"to close, finish, come full circle.\" Meaning \"elevated rolling grassland\" is from c. 1300. The non-English Germanic words tend to mean \"dune, sand bank\" (see dune), while the Celtic cognates tend to mean \"hill, citadel\" (compare Old Irish dun \"hill, hill fort;\" Welsh din \"fortress, hill fort;\" and second element in place names London, Verdun, etc.). German Düne, French dune, Italian, Spanish duna are said to be loan-words from Dutch. 1560s, from down (adv.). Meaning \"swallow hastily\" is by 1860; football sense of \"bring down (an opposing player) by tackling\" is attested by 1887. Related: Downed; downing.","totRight":0,"totWrong":0,"consecRight":0,"consecWrong":0,"totConsecRight":0,"dataPoints":0,"avgConsecRight":0.0,"turnsLeft":0}],"letter":"n","links":[null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null]},null,null,null,null,null,null,null,null,null,null,null,null]},null,null,null]},null,null,null,null,{"words":[],"letter":"t","links":[null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,{"words":[],"letter":"i","links":[null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,{"words":[],"letter":"g","links":[null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,{"words":[],"letter":"e","links":[null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,{"words":[{"word":"tiger","pronounciation":"[tahy-ger]","keywords":["large cat"],"definitions":["a large, carnivorous, tawny-colored and black-striped feline, Panthera tigris, of Asia, ranging in several subspecies from India and the Malay Peninsula to Siberia","the cougar, jaguar, thylacine, or other animal resembling the tiger.","a person resembling a tiger in fierceness, courage, etc.","a country that is considered to have a tiger economy","an additional cheer (often the word tiger) at the end of a round of cheering.","any of several strong, voracious fishes, as a sand shark.","any of numerous animals with stripes similar to a tiger\u0027s.","noting or relating to a strict parenting style that demands academic excellence and obedience from children, associated especially with East Asians","Eldrick [el-drik] /ˈɛl drɪk/, Tiger, born 1975, U.S. professional golfer.","Lake of the. Lake of the Woods."],"exampleSentences":[" the entire species is endangered, with some subspecies thought to be extinct.",null,null," Taiwan is one of the four Asian tigers.",null,null,null,"a tiger mom; tiger parenting.",null,null],"etymology":"Old English tigras (plural), also in part from Old French tigre \"tiger\" (mid-12c.), both from Latin tigris \"tiger,\" from Greek tigris, possibly from an Iranian source akin to Old Persian tigra- \"sharp, pointed,\" Avestan tighri- \"arrow,\" in reference to its springing on its prey, \"but no application of either word, or any derivative, to the tiger is known in Zend.\" [OED]. Of tiger-like persons from c. 1500. The meaning \"shriek or howl at the end of a cheer\" is recorded from 1845, American English, and is variously explained. Tiger\u0027s-eye \"yellowish-brown quartz\" is recorded from 1886.","totRight":0,"totWrong":0,"consecRight":0,"consecWrong":0,"totConsecRight":0,"dataPoints":0,"avgConsecRight":0.0,"turnsLeft":0}],"letter":"r","links":[null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null]},null,null,null,null,null,null,null,null]},null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null]},null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null]},null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null]},null,null,{"words":[],"letter":"w","links":[null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,{"words":[],"letter":"o","links":[null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,{"words":[],"letter":"o","links":[null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,{"words":[{"word":"wood","pronounciation":"[woo d]","keywords":["forest"],"definitions":["the hard, fibrous substance composing most of the stem and branches of a tree or shrub, and lying beneath the bark; the xylem.","the trunks or main stems of trees as suitable for architectural and other purposes; timber or lumber.","firewood.","the cask, barrel, or keg, as distinguished from the bottle","woodblock(def 1).","Music. a woodwind instrument. the section of a band or orchestra composed of woodwinds.","Often woods. (used with a singular or plural verb) a large and thick collection of growing trees; a grove or forest","Golf. a club with a wooden head, as a driver, brassie, spoon, or baffy for hitting long shots. Compare iron(def 5).","made of wood; wooden.","used to store, work, or carry wood","dwelling or growing in woods","to cover or plant with trees.","to supply with wood; get supplies of wood for.","to take in or get supplies of wood (often followed by up)","have the wood on, Australian Slang. to have an advantage over or have information that can be used against.","knock on wood, (used when knocking on something wooden to assure continued good luck)","out of the woods, out of a dangerous, perplexing, or difficult situation; secure; safe. no longer in precarious health or critical condition; out of danger and recovering.","wild, as with rage or excitement.","mad; insane.","Grant,1892–1942, U.S. painter.","Leonard,1860–1927, U.S. military doctor and political administrator."],"exampleSentences":[null,null,null," aged in the wood.",null,null," They picnicked in the woods.",null,null," a wood chisel."," wood bird.",null,null," to wood up before the approach of winter.",null," The car\u0027s still in good shape, knock on wood.Also especially British, touch wood.",null,null,null,null,null],"etymology":"Old English wudu, earlier widu \"tree, trees collectively, forest, grove; the substance of which trees are made,\" from Proto-Germanic *widu- (source also of Old Norse viðr, Danish and Swedish ved \"tree, wood,\" Old High German witu \"wood\"), from PIE *widhu- \"tree, wood\" (source also of Welsh gwydd \"trees,\" Gaelic fiodh- \"wood, timber,\" Old Irish fid \"tree, wood\"). Out of the woods \"safe\" is from 1792. \"violently insane\" (now obsolete), from Old English wod \"mad, frenzied,\" from Proto-Germanic *woda- (source also of Gothic woþs \"possessed, mad,\" Old High German wuot \"mad, madness,\" German wut \"rage, fury\"), from PIE *wet- (1) \"to blow; inspire, spiritually arouse;\" source of Latin vates \"seer, poet,\" Old Irish faith \"poet;\" \"with a common element of mental excitement\" [Buck]. Compare Old English woþ \"sound, melody, song,\" Old Norse oðr \"poetry,\" and the god-name Odin.","totRight":0,"totWrong":0,"consecRight":0,"consecWrong":0,"totConsecRight":0,"dataPoints":0,"avgConsecRight":0.0,"turnsLeft":0}],"letter":"d","links":[null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null]},null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null]},null,null,null,null,null,null,null,null,null,null,null]},null,null,null,null,null,null,null,null,null,null,null]},null,null,null]},"numWords":5,"totalWords":[{"word":"tiger","pronounciation":"[tahy-ger]","keywords":["large cat"],"definitions":["a large, carnivorous, tawny-colored and black-striped feline, Panthera tigris, of Asia, ranging in several subspecies from India and the Malay Peninsula to Siberia","the cougar, jaguar, thylacine, or other animal resembling the tiger.","a person resembling a tiger in fierceness, courage, etc.","a country that is considered to have a tiger economy","an additional cheer (often the word tiger) at the end of a round of cheering.","any of several strong, voracious fishes, as a sand shark.","any of numerous animals with stripes similar to a tiger\u0027s.","noting or relating to a strict parenting style that demands academic excellence and obedience from children, associated especially with East Asians","Eldrick [el-drik] /ˈɛl drɪk/, Tiger, born 1975, U.S. professional golfer.","Lake of the. Lake of the Woods."],"exampleSentences":[" the entire species is endangered, with some subspecies thought to be extinct.",null,null," Taiwan is one of the four Asian tigers.",null,null,null,"a tiger mom; tiger parenting.",null,null],"etymology":"Old English tigras (plural), also in part from Old French tigre \"tiger\" (mid-12c.), both from Latin tigris \"tiger,\" from Greek tigris, possibly from an Iranian source akin to Old Persian tigra- \"sharp, pointed,\" Avestan tighri- \"arrow,\" in reference to its springing on its prey, \"but no application of either word, or any derivative, to the tiger is known in Zend.\" [OED]. Of tiger-like persons from c. 1500. The meaning \"shriek or howl at the end of a cheer\" is recorded from 1845, American English, and is variously explained. Tiger\u0027s-eye \"yellowish-brown quartz\" is recorded from 1886.","totRight":0,"totWrong":0,"consecRight":0,"consecWrong":0,"totConsecRight":0,"dataPoints":0,"avgConsecRight":0.0,"turnsLeft":0},{"word":"wood","pronounciation":"[woo d]","keywords":["forest"],"definitions":["the hard, fibrous substance composing most of the stem and branches of a tree or shrub, and lying beneath the bark; the xylem.","the trunks or main stems of trees as suitable for architectural and other purposes; timber or lumber.","firewood.","the cask, barrel, or keg, as distinguished from the bottle","woodblock(def 1).","Music. a woodwind instrument. the section of a band or orchestra composed of woodwinds.","Often woods. (used with a singular or plural verb) a large and thick collection of growing trees; a grove or forest","Golf. a club with a wooden head, as a driver, brassie, spoon, or baffy for hitting long shots. Compare iron(def 5).","made of wood; wooden.","used to store, work, or carry wood","dwelling or growing in woods","to cover or plant with trees.","to supply with wood; get supplies of wood for.","to take in or get supplies of wood (often followed by up)","have the wood on, Australian Slang. to have an advantage over or have information that can be used against.","knock on wood, (used when knocking on something wooden to assure continued good luck)","out of the woods, out of a dangerous, perplexing, or difficult situation; secure; safe. no longer in precarious health or critical condition; out of danger and recovering.","wild, as with rage or excitement.","mad; insane.","Grant,1892–1942, U.S. painter.","Leonard,1860–1927, U.S. military doctor and political administrator."],"exampleSentences":[null,null,null," aged in the wood.",null,null," They picnicked in the woods.",null,null," a wood chisel."," wood bird.",null,null," to wood up before the approach of winter.",null," The car\u0027s still in good shape, knock on wood.Also especially British, touch wood.",null,null,null,null,null],"etymology":"Old English wudu, earlier widu \"tree, trees collectively, forest, grove; the substance of which trees are made,\" from Proto-Germanic *widu- (source also of Old Norse viðr, Danish and Swedish ved \"tree, wood,\" Old High German witu \"wood\"), from PIE *widhu- \"tree, wood\" (source also of Welsh gwydd \"trees,\" Gaelic fiodh- \"wood, timber,\" Old Irish fid \"tree, wood\"). Out of the woods \"safe\" is from 1792. \"violently insane\" (now obsolete), from Old English wod \"mad, frenzied,\" from Proto-Germanic *woda- (source also of Gothic woþs \"possessed, mad,\" Old High German wuot \"mad, madness,\" German wut \"rage, fury\"), from PIE *wet- (1) \"to blow; inspire, spiritually arouse;\" source of Latin vates \"seer, poet,\" Old Irish faith \"poet;\" \"with a common element of mental excitement\" [Buck]. Compare Old English woþ \"sound, melody, song,\" Old Norse oðr \"poetry,\" and the god-name Odin.","totRight":0,"totWrong":0,"consecRight":0,"consecWrong":0,"totConsecRight":0,"dataPoints":0,"avgConsecRight":0.0,"turnsLeft":0},{"word":"air","pronounciation":"[air]","keywords":["gases forming the atmosphere","distinctive quality or character","style","musical tune","put into the atmosphere","freshen","express opinion publicly"],"definitions":["a mixture of nitrogen, oxygen, and minute amounts of other gases that surrounds the earth and forms its atmosphere.","a stir in the atmosphere; a light breeze.","overhead space; sky","circulation; publication; publicity","the general character or complexion of anything; appearance","the peculiar look, appearance, and bearing of a person","airs, affected or unnatural manner; manifestation of pride or vanity; assumed haughtiness","Music. a tune; melody. the soprano or treble part. an aria. Also ayre.an Elizabethan art song.","aircraft as a means of transportation","Informal. air conditioning or an air-conditioning system","Sports. (during an airborne stunt) the height between the ground and an athlete or an athlete with his or her equipment","Radio. the medium through which radio waves are transmitted.","Archaic. breath.","to expose to the air; give access to the open air; ventilate (often followed by out)","to expose ostentatiously; bring to public notice; display","to broadcast or televise.","to be exposed to the open air (often followed by out)","to be broadcast or televised.","operating by means of air pressure or by acting upon air","of or relating to aircraft or to aviation","taking place in the air; aerial","clear the air, to eliminate dissension, ambiguity, or tension from a discussion, situation, etc.","get some air, to take a break from an unpleasant encounter or stifling environment","get the air, Informal. to be rejected, as by a lover. to be dismissed, as by an employer","give (someone) the air, Informal. to reject, as a lover","in the air, in circulation; current","into thin air, completely out of sight or reach","off the air, not broadcasting","on the air, in the act of broadcasting; being broadcast","put on airs, to assume an affected or haughty manner","take the air, to go out-of-doors; take a short walk or ride. Slang.to leave, especially hurriedly. to begin broadcasting.","up in the air, Also in the air.undecided or unsettled","walk/tread on air, to feel very happy; be elated.","early.","Obsolete. before; previously.","a region in N Niger, in the Sahara"],"exampleSentences":[null,null," The planes filled the air."," to give air to one\u0027s theories."," His early work had an air of freshness and originality."," There is an air of mystery about him."," He acquired airs that were insufferable to his friends.",null," to arrive by air; to ship goods by air."," The price includes tires, radio, and air."," The BMX course was designed for riders to get good air. such a jump or other airborne stunt: The snowboarder took first place with four clean airs.",null,null," We air the bedrooms every day."," to air one\u0027s opinions; to air one\u0027s theories.",null," Open the window and let the room air out.",null," an air drill; an air pump."," air industry."," air war."," The staff meeting was intended to help clear the air."," She walked away from the argument to get some air. to take a short rest."," He had worked only a few days when he got the air."," He was bitter because she gave him the air. to dismiss, as an employee."," There\u0027s a rumor in the air that we\u0027re moving to a new location."," He vanished into thin air."," The station goes off the air at midnight. not broadcast; out of operation as a broadcast: The program went off the air years ago."," The program will be going on the air in a few seconds."," As their fortune increased, they began to put on airs.",null," The contract is still up in the air. Informal.angry; perturbed: There is no need to get up in the air over a simple mistake.",null,null,null," low massif and oases. About 30,000 sq. mi. (77,700 sq. km)."],"etymology":"c. 1300, \"invisible gases that surround the earth,\" from Old French air \"atmosphere, breeze, weather\" (12c.), from Latin aer \"air, lower atmosphere, sky,\" from Greek aer (genitive aeros) \"mist, haze, clouds,\" later \"atmosphere\" (related to aenai \"to blow, breathe\"), which is of unknown origin. It is possibly from a PIE *awer- and thus related to aeirein \"to raise\" and arteria \"windpipe, artery\" (see aorta) on notion of \"lifting, suspended, that which rises,\" but this has phonetic difficulties. In Homer mostly \"thick air, mist;\" later \"air\" as one of the four elements. Words for \"air\" in Indo-European languages tend to be associated with wind, brightness, sky. In English, air replaced native lyft, luft (see loft (n.)). In old chemistry, air (with a qualifying adjective) was used of any gas. To be in the air \"in general awareness\" is from 1875; up in the air \"uncertain, doubtful\" is from 1752. To build castles in the air \"entertain visionary schemes that have no practical foundation\" is from 1590s (in 17c. English had airmonger \"one preoccupied with visionary projects\"). Broadcasting sense (as in on the air, airplay) first recorded 1927. To give (someone) the air \"dismiss\" is from 1900. Air pollution is attested by 1870. Air guitar by 1983. Air traffic controller is from 1956. 1590s, \"manner, appearance\" (as in an air of mystery); 1650s, \"assumed manner, affected appearance\" (especially in phrase put on airs, 1781), from French air \"look, appearance, mien, bearing, tone\" (Old French aire \"reality, essence, nature, descent, extraction\" (12c.); compare debonair), which is perhaps from Latin ager \"place, field, productive land\" (from PIE root *agro- \"field\") on notion of \"place of origin.\" But some French sources connect this Old French word with the source of air (n.1), and it also is possible these senses in English developed from or were influenced by air (n.1); compare sense development of atmosphere and Latin spiritus \"breath, breeze,\" also \"high spirit, pride,\" and the extended senses of anima. \"melody, tune, connected rhythmic succession of distinct musical sounds,\" 1580s, nativized from Italian aria (see aria), perhaps via French. 1520s, \"expose to open air,\" 1520s, from air (n.1). Figurative sense of \"expose ostentatiously, make public\" is from 1610s of objects, 1862 of opinions, grievances, etc. Meaning \"to broadcast\" (originally on radio) is from 1933. Related: Aired; airing.","totRight":0,"totWrong":0,"consecRight":0,"consecWrong":0,"totConsecRight":0,"dataPoints":0,"avgConsecRight":0.0,"turnsLeft":0},{"word":"down","pronounciation":"[doun]","keywords":["below","physically lower","unhappy"],"definitions":["from higher to lower; in descending direction or order; toward, into, or in a lower position","on or to the ground, floor, or bottom","to or in a sitting or lying position.","to or in a position, area, or district considered lower, especially from a geographical or cartographic standpoint, as to the south, a business district, etc.","to or at a lower value or rate.","to a lesser pitch or volume","in or to a calmer, less active, or less prominent state","from an earlier to a later time","from a greater to a lesser strength, amount, etc.","in an attitude of earnest application","on paper or in a book","in cash at the time of purchase; at once","to the point of defeat, submission, inactivity, etc.","in or into a fixed or supine position","to the source or actual position","into a condition of ill health","in or into a lower status or condition","Nautical. toward the lee side, so as to turn a vessel to windward","Slang. on toast (as used in ordering a sandwich at a lunch counter or restaurant)","in a descending or more remote direction or place on, over, or along","downward; going or directed downward","being at a low position or on the ground, floor, or bottom.","toward the south, a business district, etc.","associated with or serving traffic, transportation, or the like, directed toward the south, a business district, etc.","downcast; depressed; dejected","ailing, especially, sick and bedridden","being the portion of the full price, as of an article bought on the installment plan, that is paid at the time of purchase or delivery","Football. (of the ball) not in play.","Slang. agreeing, supporting, or understanding","behind an opponent or opponents in points, games, etc.","Baseball. out.","losing or having lost the amount indicated, especially at gambling","having placed one\u0027s bet","finished, done, considered, or taken care of","out of order","a downward movement; descent.","a turn for the worse; reverse","Football. one of a series of four plays during which a team must advance the ball at least 10 yards (9 meters) to keep possession of it. the declaring of the ball as down or out of play, or the play immediately preceding this.","Slang. an order of toast at a lunch counter or restaurant.","Slang. downer(defs 1a, b).","to put, knock, or throw down; subdue","to drink down, especially quickly or in one gulp","Informal. to defeat in a game or contest","to cause to fall from a height, especially by shooting","to go down; fall.","(used as a command to a dog to stop attacking, to stop jumping on someone, to get off a couch or chair, etc.)","(used as a command or warning to duck, take cover, or the like)","down and out, down-and-out.","down cold/pat, mastered or learned perfectly","down in the mouth, discouraged; depressed; sad.","down on, Informal. hostile or averse to","down with! away with! cease!","the soft, first plumage of many young birds.","the soft under plumage of birds as distinct from the contour feathers.","the under plumage of some birds, as geese and ducks, used for filling in quilts, clothing, etc., chiefly for warmth.","a growth of soft, fine hair or the like.","Botany. a fine, soft pubescence on plants and some fruits. the light, feathery pappus or coma on seeds by which they are borne on the wind, as on the dandelion and thistle.","filled with down","Often downs. (used especially in southern England) open, rolling, upland country with fairly smooth slopes usually covered with grass.","(initial capital letter) any sheep of several breeds, raised originally in the downs of southern England, as the Southdown, Suffolk, etc.","Archaic. a hill, especially a sand hill or dune.","a county in SW Northern Ireland. 952 sq. mi. (2466 sq. km). County seat","an administrative district in this county. 253 sq. mi. (654 sq. km)."],"exampleSentences":[" to come down the ladder."," He fell down.",null," We drove from San Francisco down to Los Angeles.",null," Turn down the radio."," The wind died down."," from the 17th century down to the present."," to water down liquor."," to get down to work."," Write down the address."," We paid $50 down and $20 a month."," They shouted down the opposition."," They tied down the struggling animal."," The dogs tracked down the bear."," He\u0027s come down with a cold."," kept down by lack of education."," Put the helm down!"," Give me a tuna down."," They ran off down the street."," the down escalator.",null,null," the down platform."," You seem very down today."," He\u0027s been down with a bad cold."," a payment of $200 down.",null," I\u0027m totally down with that. He\u0027s down with those kids. sophisticated or hip; cool: That music is down."," The team won the pennant despite having been down three games in the final week of play.",null," After an hour at poker, he was down $10."," Are you down for the fourth race?"," five down and one to go."," The computer has been down all day.",null," The business cycle experienced a sudden down.",null,null,null," He downed his opponent in the third round."," to down a tankard of ale."," The Mets downed the Dodgers in today\u0027s game."," Antiaircraft guns downed ten bombers.",null," Down, Rover!"," Down! They\u0027re starting to shoot!",null," Another hour of studying and I\u0027ll have the math lesson down cold.",null," Why are you so down on sports?"," Down with tyranny! on or toward the ground or into a lower position: Down with your rifles!",null,null,null,null,null," a down jacket.",null,null,null," Downpatrick.",null],"etymology":"late Old English shortened form of Old English ofdune \"downwards,\" from dune \"from the hill,\" dative of dun \"hill\" (see down (n.2)). A sense development peculiar to English. Used as a preposition since c. 1500. Sense of \"depressed mentally\" is attested from c. 1600. Slang sense of \"aware, wide awake\" is attested from 1812. Computer crash sense is from 1965. As a preposition from late 14c.; as an adjective from 1560s. Down-and-out is from 1889, American English, from situation of a beaten prizefighter. Down home (adj.) is 1931, American English; down the hatch as a toast is from 1931; down to the wire is 1901, from horse-racing. Down time is from 1952. Down under \"Australia and New Zealand\" attested from 1886; Down East \"Maine\" is from 1825; Down South \"in the Southern states of the U.S.\" is attested by 1834. \"soft feathers,\" late 14c., from Old Norse dunn, of uncertain origin. Old English dun \"down, moor; height, hill, mountain,\" from Proto-Germanic *dunaz- (source also of Middle Dutch dunen \"sandy hill,\" Dutch duin), \"probably a pre-insular loan-word from Celtic\" [Cambridge Dictionary of English Place-Names], in other words, borrowed at a very early period, before the Anglo-Saxon migration, from PIE root *dheue- \"to close, finish, come full circle.\" Meaning \"elevated rolling grassland\" is from c. 1300. The non-English Germanic words tend to mean \"dune, sand bank\" (see dune), while the Celtic cognates tend to mean \"hill, citadel\" (compare Old Irish dun \"hill, hill fort;\" Welsh din \"fortress, hill fort;\" and second element in place names London, Verdun, etc.). German Düne, French dune, Italian, Spanish duna are said to be loan-words from Dutch. 1560s, from down (adv.). Meaning \"swallow hastily\" is by 1860; football sense of \"bring down (an opposing player) by tackling\" is attested by 1887. Related: Downed; downing.","totRight":0,"totWrong":0,"consecRight":0,"consecWrong":0,"totConsecRight":0,"dataPoints":0,"avgConsecRight":0.0,"turnsLeft":0},{"word":"down","pronounciation":"[doun]","keywords":["below","physically lower","unhappy"],"definitions":["from higher to lower; in descending direction or order; toward, into, or in a lower position","on or to the ground, floor, or bottom","to or in a sitting or lying position.","to or in a position, area, or district considered lower, especially from a geographical or cartographic standpoint, as to the south, a business district, etc.","to or at a lower value or rate.","to a lesser pitch or volume","in or to a calmer, less active, or less prominent state","from an earlier to a later time","from a greater to a lesser strength, amount, etc.","in an attitude of earnest application","on paper or in a book","in cash at the time of purchase; at once","to the point of defeat, submission, inactivity, etc.","in or into a fixed or supine position","to the source or actual position","into a condition of ill health","in or into a lower status or condition","Nautical. toward the lee side, so as to turn a vessel to windward","Slang. on toast (as used in ordering a sandwich at a lunch counter or restaurant)","in a descending or more remote direction or place on, over, or along","downward; going or directed downward","being at a low position or on the ground, floor, or bottom.","toward the south, a business district, etc.","associated with or serving traffic, transportation, or the like, directed toward the south, a business district, etc.","downcast; depressed; dejected","ailing, especially, sick and bedridden","being the portion of the full price, as of an article bought on the installment plan, that is paid at the time of purchase or delivery","Football. (of the ball) not in play.","Slang. agreeing, supporting, or understanding","behind an opponent or opponents in points, games, etc.","Baseball. out.","losing or having lost the amount indicated, especially at gambling","having placed one\u0027s bet","finished, done, considered, or taken care of","out of order","a downward movement; descent.","a turn for the worse; reverse","Football. one of a series of four plays during which a team must advance the ball at least 10 yards (9 meters) to keep possession of it. the declaring of the ball as down or out of play, or the play immediately preceding this.","Slang. an order of toast at a lunch counter or restaurant.","Slang. downer(defs 1a, b).","to put, knock, or throw down; subdue","to drink down, especially quickly or in one gulp","Informal. to defeat in a game or contest","to cause to fall from a height, especially by shooting","to go down; fall.","(used as a command to a dog to stop attacking, to stop jumping on someone, to get off a couch or chair, etc.)","(used as a command or warning to duck, take cover, or the like)","down and out, down-and-out.","down cold/pat, mastered or learned perfectly","down in the mouth, discouraged; depressed; sad.","down on, Informal. hostile or averse to","down with! away with! cease!","the soft, first plumage of many young birds.","the soft under plumage of birds as distinct from the contour feathers.","the under plumage of some birds, as geese and ducks, used for filling in quilts, clothing, etc., chiefly for warmth.","a growth of soft, fine hair or the like.","Botany. a fine, soft pubescence on plants and some fruits. the light, feathery pappus or coma on seeds by which they are borne on the wind, as on the dandelion and thistle.","filled with down","Often downs. (used especially in southern England) open, rolling, upland country with fairly smooth slopes usually covered with grass.","(initial capital letter) any sheep of several breeds, raised originally in the downs of southern England, as the Southdown, Suffolk, etc.","Archaic. a hill, especially a sand hill or dune.","a county in SW Northern Ireland. 952 sq. mi. (2466 sq. km). County seat","an administrative district in this county. 253 sq. mi. (654 sq. km)."],"exampleSentences":[" to come down the ladder."," He fell down.",null," We drove from San Francisco down to Los Angeles.",null," Turn down the radio."," The wind died down."," from the 17th century down to the present."," to water down liquor."," to get down to work."," Write down the address."," We paid $50 down and $20 a month."," They shouted down the opposition."," They tied down the struggling animal."," The dogs tracked down the bear."," He\u0027s come down with a cold."," kept down by lack of education."," Put the helm down!"," Give me a tuna down."," They ran off down the street."," the down escalator.",null,null," the down platform."," You seem very down today."," He\u0027s been down with a bad cold."," a payment of $200 down.",null," I\u0027m totally down with that. He\u0027s down with those kids. sophisticated or hip; cool: That music is down."," The team won the pennant despite having been down three games in the final week of play.",null," After an hour at poker, he was down $10."," Are you down for the fourth race?"," five down and one to go."," The computer has been down all day.",null," The business cycle experienced a sudden down.",null,null,null," He downed his opponent in the third round."," to down a tankard of ale."," The Mets downed the Dodgers in today\u0027s game."," Antiaircraft guns downed ten bombers.",null," Down, Rover!"," Down! They\u0027re starting to shoot!",null," Another hour of studying and I\u0027ll have the math lesson down cold.",null," Why are you so down on sports?"," Down with tyranny! on or toward the ground or into a lower position: Down with your rifles!",null,null,null,null,null," a down jacket.",null,null,null," Downpatrick.",null],"etymology":"late Old English shortened form of Old English ofdune \"downwards,\" from dune \"from the hill,\" dative of dun \"hill\" (see down (n.2)). A sense development peculiar to English. Used as a preposition since c. 1500. Sense of \"depressed mentally\" is attested from c. 1600. Slang sense of \"aware, wide awake\" is attested from 1812. Computer crash sense is from 1965. As a preposition from late 14c.; as an adjective from 1560s. Down-and-out is from 1889, American English, from situation of a beaten prizefighter. Down home (adj.) is 1931, American English; down the hatch as a toast is from 1931; down to the wire is 1901, from horse-racing. Down time is from 1952. Down under \"Australia and New Zealand\" attested from 1886; Down East \"Maine\" is from 1825; Down South \"in the Southern states of the U.S.\" is attested by 1834. \"soft feathers,\" late 14c., from Old Norse dunn, of uncertain origin. Old English dun \"down, moor; height, hill, mountain,\" from Proto-Germanic *dunaz- (source also of Middle Dutch dunen \"sandy hill,\" Dutch duin), \"probably a pre-insular loan-word from Celtic\" [Cambridge Dictionary of English Place-Names], in other words, borrowed at a very early period, before the Anglo-Saxon migration, from PIE root *dheue- \"to close, finish, come full circle.\" Meaning \"elevated rolling grassland\" is from c. 1300. The non-English Germanic words tend to mean \"dune, sand bank\" (see dune), while the Celtic cognates tend to mean \"hill, citadel\" (compare Old Irish dun \"hill, hill fort;\" Welsh din \"fortress, hill fort;\" and second element in place names London, Verdun, etc.). German Düne, French dune, Italian, Spanish duna are said to be loan-words from Dutch. 1560s, from down (adv.). Meaning \"swallow hastily\" is by 1860; football sense of \"bring down (an opposing player) by tackling\" is attested by 1887. Related: Downed; downing.","totRight":0,"totWrong":0,"consecRight":0,"consecWrong":0,"totConsecRight":0,"dataPoints":0,"avgConsecRight":0.0,"turnsLeft":0}]}